     A*****************************************************************
     A*     FILE NAME:  ORDCHG                                        *
     A*  RELATED PGMS:  ORDCHG (RPGLE)                                 *
     A* RELATED FILES:  CUSMSTL1, ORDMSTL1, ORDDTL                    *
     A*   DESCRIPTION:  ORDER CHANGE DISPLAY FILE. HDRSCN PROMPTS FOR  *
     A*                 AN ORDER ID. ORDCTLR SHOWS THE HEADER          *
     A*                 (READ-ONLY) AND THE EXISTING LINES IN A        *
     A*                 SUBFILE -- QTYORD CAN BE CHANGED AND A LINE     *
     A*                 CAN BE MARKED FOR REMOVAL (DEL). ITEM AND      *
     A*                 PRICE ARE NOT CHANGEABLE HERE.                 *
     A*****************************************************************
     A                                      CHGINPDFT(CS)
     A                                      PRINT(QSYSPRT)
     A                                      INDARA
     A          R HDRSCN
     A                                      TEXT('PROMPT FOR ORDER ID')
     A                                      CA03(03 'EXIT')
     A                                  2  4TIME
     A                                      DSPATR(HI)
     A                                  2 27'ORDER CHANGE'
     A                                      DSPATR(HI RI)
     A                                  2 70DATE
     A                                      EDTCDE(Y)
     A                                      DSPATR(HI)
     A            ORDID          7  0B 10 25EDTCDE(Z)
     A  52                                  ERRMSG('ORDER NOT ON FILE' 52)
     A  53                                  ERRMSG('ORDER NOT IN PROCESS - +
     A                                      CANNOT CHANGE' 53)
     A                                 10 33'<--Enter Order Number'
     A                                      DSPATR(HI)
     A                                 23  4'F3 Exit'
     A          R ORDLIN2                   SFL
     A            LINE           3  0H
     A            ITEMID        10   O 11  4
     A            QTYORD         7  0B 11 18EDTCDE(Z)
     A            QTYSHP         7  0O 11 28EDTCDE(Z)
     A            PRICE          9  2O 11 38
     A            DELFLAG        1   B 11 50
     A          R ORDCTLR                   SFLCTL(ORDLIN2)
     A                                      TEXT('ORDER CHANGE SCREEN')
     A                                      CF05(05 'SAVE CHANGES')
     A                                      CA12(12 'CANCEL')
     A  20                                  SFLCLR
     A N20                                  SFLDSPCTL
     A N20                                  SFLDSP
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0008)
     A                                  2  4TIME
     A                                      DSPATR(HI)
     A                                  2 27'ORDER CHANGE'
     A                                      DSPATR(HI RI)
     A                                  2 70DATE
     A                                      EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                  4 14'Order:'
     A                                      DSPATR(HI)
     A            ORDID          7  0O  4 25EDTCDE(Z)
     A            CUST           5  0O  4 36EDTCDE(Z)
     A            CUSNAME       20   O  4 45
     A                                  6 14'PO:'
     A                                      DSPATR(HI)
     A            CUSPO         10   O  6 25
     A                                  6 40'Status:'
     A                                      DSPATR(HI)
     A            ORDSTAT        1   O  6 51
     A                                  8  4'Item ID'
     A                                      DSPATR(HI UL)
     A                                  8 18'Qty Ordered'
     A                                      DSPATR(HI UL)
     A                                  8 28'Qty Shipped'
     A                                      DSPATR(HI UL)
     A                                  8 38'Price'
     A                                      DSPATR(HI UL)
     A                                  8 50'Del'
     A                                      DSPATR(HI UL)
     A            ERRTXT        60   O  9  2
     A                                      DSPATR(HI)
     A                                 10  2'F5 Save changes  F12 Cancel'
