     A*****************************************************************
     A*     FILE NAME:  ORDMSTL2                                      *
     A*  RELATED PGMS:  (none yet)                                    *
     A* RELATED FILES:  ORDMST  (PHYSICAL FILE)                       *
     A*   DESCRIPTION:  THIS IS LOGICAL FILE ORDMSTL2.                *
     A*                 IT CONTAINS ONE RECORD FORMAT CALLED OMLREC2. *
     A*                 LOGICAL VIEW OF ORDER MASTER (ORDMST)         *
     A*                 BY CUSTOMER NUMBER (CUST) AND CUSTOMER PO     *
     A*                 NUMBER (CUSPO) -- LETS AN ORDER BE FILED/     *
     A*                 FOUND BY WHO IT'S FOR AND THEIR OWN PO NBR.   *
     A*****************************************************************
     A          R OMLREC2                   PFILE(ORDMST)
     A            ORDID
     A            CUST
     A            CUSPO
     A            ORDDT
     A          K CUST
     A          K CUSPO
