     A*****************************************************************
     A*     FILE NAME:  ORDMSTL1                                      *
     A*  RELATED PGMS:  ORDENT, DATACHURN                             *
     A* RELATED FILES:  ORDMST  (PHYSICAL FILE)                       *
     A*   DESCRIPTION:  LOGICAL VIEW OF ORDER MASTER (ORDMST)         *
     A*                 BY ORDER ID (ORDID).                          *
     A*****************************************************************
     A          R OMLREC1                   PFILE(ORDMST)
     A            ORDID
     A            CUST
     A            CUSPO
     A            ORDDT
     A            ORDSTAT
     A          K ORDID
