     A*****************************************************************
     A* FILE NAME:  ORDMST                                            *
     A* RELATED PGMS:  ORDENT                                         *
     A* RELATED FILES:  ORDMSTL1 (LOGICAL FILE, KEYED BY ORDID)       *
     A*                 ORDDTL   (ORDER LINES, KEYED BY ORDID+LINE)   *
     A*                 CUSMST   (CUST MUST EXIST, NOT IN COLLECTIONS)*
     A* DESCRIPTION:  ORDER HEADER. ORDID IS SYSTEM ASSIGNED FROM     *
     A*          ORDCTL. ORDSTAT: O=IN PROCESS F=FILLED S=SHIPPED.    *
     A*****************************************************************
     A          R ORDREC
     A            ORDID          7  0       TEXT('ORDER ID')
     A            CUST           5  0       TEXT('CUSTOMER NUMBER')
     A            CUSPO         10          TEXT('CUSTOMER PO NUMBER')
     A            ORDDT           L          TEXT('ORDER DATE')
     A                                      DATFMT(*ISO)
     A            ORDSTAT        1          TEXT('ORDER STATUS O/F/S')
     A          K ORDID
